app/Http/Controllers/CriteriaController.php

    public function index()
    {
        return Inertia::render('Criteria/Index', [
            'criteria' => Criteria::latest()->get(),
        ]);
---
select * from `criterias` order by `created_at` desc